---
kind: property
id: P:Autodesk.Revit.DB.ImageInstance.CanHaveSnaps
source: html/ac6a3521-50ad-3573-11b1-d29038730dae.htm
---
# Autodesk.Revit.DB.ImageInstance.CanHaveSnaps Property

When true the ImageInstance has snaps that can be enabled with the EnableSnaps property

## Syntax (C#)
```csharp
public bool CanHaveSnaps { get; }
```

## Remarks
Snaps are only available for images based on PDF files that are vector based.